# J-Самая вкусная задача
# Перевести число, записанное римскими цифрами, в число, записанное арабскими цифрами.
# Символы: I - 1, V - 5, X - 10, L - 50, C - 100, D - 500, M - 1000
# Выжимка из википедии:
# Натуральные числа записываются при помощи повторения этих цифр.
# При этом, если большая цифра стоит перед меньшей, то они складываются (принцип сложения),
# если же меньшая стоит перед большей, то меньшая вычитается из большей (принцип вычитания).
# Последнее правило применяется только во избежание четырёхкратного повторения одной и той же цифры.
# Формат входных данных
# Строка, представляющая число из римских цифр.
# Формат выходных данных
# Это же число в арабских цифрах. Стоит выводить число, конвертированное в строку, т.е. str(answer)