# Есть результаты работы студентов в семестре.
# Студентов выводить в порядке суммы их баллов. Требутеся вывести отсортированные результаты работ для каждого студента.
# Данные вводятся как: student_id value
# student_id принимает значения от 0 до N. value от 1 до 10
# Пример входных данных: 0 3 0 5 1 3 1 2
# Тут представленны данные о двух студента: 0 и 1. Сумма балов студента 0 - 8. Студента 1 - 5.
# Значит, сначала должны быть напечатаны результаты 0 студента, затем 1.
# Таким образом сначала надо вывести отсортированные результаты студента 0, затем студента 1: 5 3 3 2
# Напомним, что у list в питоне есть встроенный метод sort и есть функция sorted.
# У них есть параметр key, который определяет по каким значениям будет сортироваться объект.
# Например код ниже будет сортировать лист по длинне его элементов. Так же есть параметр reverse.
# a = ['###', '@', '??'] a.sort(key=lambda x: len(x)) a ['@', '??', '###']
# a.sort(key=lambda x: len(x), reverse=True) ['###', '??', '@']
# Что такое лямбда функция вы узнаете в дальнейшем (так же всегда есть сайт google).
# Для выполнения этого задания достаточно понять, на что надо заменить функцию len.
# Формат входных данных
# В первой строке N - количество студентов.
# Далее идет какое-то количество строк (не равное N) с результатами студентов в формате:
# student_id value. 0 <= student_id < N. Значения разделены пробелом. Ввод заканчивается #.
# Формат выходных данных
# Вывести отсортированные результаты студентов в одну строку.
# Сначала печатаются результаты лучшего по сумме баллов студента, потом второго и так далее. Результаты в одну строку


N = int(input())
A = []
C = []

while True:
    d = input()
    if d == '#':
        break
    A.append(d)

for i in range(N):
    B = []
    for k in range(len(A)):
        # тут мы разделяем по пробелу каждый элемент массива A на два и создаем новый массив f,
        # состоящий из этих двух элементов
        f = A[k].split()
        if int(f[0]) == i:
            B.append(int(f[1]))
    if B:
        C.append(B)

C.sort(key=lambda s: (sum(s), s.sort(reverse=True)), reverse=True)
for i in C:
    for k in i:
        print(k, end=' ')
