# Задача B-Сколько единиц в бинарной записи?
# Найти, сколько единиц содержит бинарная запись числа.
# Входные данные
# Целое неотрицательное число K.
# Выходные данные
# Сколько единиц содержит бинарная запись числа.


x = int(input())
A = []
k = 0

for i in str(bin(x)):
    A.append(i)

for i in range(len(A)):
    if A[i] == '1':
        k += 1

print(k)
